# Linear Regression Models

### 1. Simple Linear Regression

In [56]:
import numpy as np
import pandas as pd
import statsmodels
import sklearn
import statsmodels.api as sm
from statsmodels.formula.api import ols
import statsmodels.stats.multicomp
import sklearn
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix
from sklearn.metrics import classification_report

In [57]:
df = pd.read_excel('CDAC_DataBook.xlsx',sheet_name = 'faithful')
df.head()

   eruptions  waiting
0      3.600       79
1      1.800       54
2      3.333       74
3      2.283       62
4      4.533       85

In [60]:
x_train = df[['waiting']]

In [61]:
y_train = df[['eruptions']]

In [62]:
x_train.head()

   waiting
0       79
1       54
2       74
3       62
4       85

In [63]:
y_train.head()

   eruptions
0      3.600
1      1.800
2      3.333
3      2.283
4      4.533

In [64]:
#add constant term to the predictor column
x_train = sm.add_constant(x_train,prepend = False)

In [65]:
mod = sm.OLS(y_train,x_train).fit()

In [66]:
print(mod.summary())

                            OLS Regression Results
==============================================================================
Dep. Variable:              eruptions   R-squared:                       0.811
Model:                            OLS   Adj. R-squared:                  0.811
Method:                 Least Squares   F-statistic:                     1162.
Date:                Thu, 29 Jun 2023   Prob (F-statistic):          8.13e-100
Time:                        14:40:13   Log-Likelihood:                -194.51
No. Observations:                 272   AIC:                             393.0
Df Residuals:                     270   BIC:                             400.2
Df Model:                           1
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
waiting        0.0756      0.002     34.089      0.000       0.071       0.080
const         -1.8740      0.160    -11.702      0.000      -2.189      -1.559
==============================================================================
Omnibus:                        4.133   Durbin-Watson:                   2.561
Prob(Omnibus):                  0.127   Jarque-Bera (JB):                3.173
Skew:                          -0.138   Prob(JB):                        0.205
Kurtosis:                       2.548   Cond. No.                         384.
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.

- p-value of waiting is greater than 0.05
- So null hypothesis of waiting is not rejected.
- waiting is dependent on erruptions
- As waiting will increases erruptions will also be increases.

### 2. Multiple Linear Regression

In [96]:
df = pd.read_excel('CDAC_DataBook.xlsx',sheet_name = 'stackloss')
df.head()

   AirFlow  WaterTemp  AcidConc  StackLoss
0       80         27        89         42
1       80         27        88         37
2       75         25        90         37
3       62         24        87         28
4       62         22        87         18

In [97]:
x_train = df.drop('StackLoss',axis=1)

In [98]:
y_train = df[['StackLoss']]

In [99]:
x_train = df[['AirFlow','WaterTemp','AcidConc']]

In [100]:
x_train.head()

   AirFlow  WaterTemp  AcidConc
0       80         27        89
1       80         27        88
2       75         25        90
3       62         24        87
4       62         22        87

In [101]:
y_train.head()

   StackLoss
0         42
1         37
2         37
3         28
4         18

In [102]:
x_train = sm.add_constant(x_train,prepend = False)

In [103]:
mod = sm.OLS(y_train,x_train).fit()

In [104]:
print(mod.summary())

                            OLS Regression Results
==============================================================================
Dep. Variable:              StackLoss   R-squared:                       0.914
Model:                            OLS   Adj. R-squared:                  0.898
Method:                 Least Squares   F-statistic:                     59.90
Date:                Thu, 29 Jun 2023   Prob (F-statistic):           3.02e-09
Time:                        14:52:11   Log-Likelihood:                -52.288
No. Observations:                  21   AIC:                             112.6
Df Residuals:                      17   BIC:                             116.8
Df Model:                           3
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
AirFlow        0.7156      0.135      5.307      0.000       0.431       1.000
WaterTemp      1.2953      0.368      3.520      0.003       0.519       2.072
AcidConc      -0.1521      0.156     -0.973      0.344      -0.482       0.178
const        -39.9197     11.896     -3.356      0.004     -65.018     -14.821
==============================================================================
Omnibus:                        0.713   Durbin-Watson:                   1.485
Prob(Omnibus):                  0.700   Jarque-Bera (JB):                0.140
Skew:                          -0.193   Prob(JB):                        0.932
Kurtosis:                       3.107   Cond. No.                     1.81e+03
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
[2] The condition number is large, 1.81e+03. This might indicate that there are
strong multicollinearity or other numerical problems.

In [20]:
x_test = sm.add_constant(x_test,prepend = False) # actual output

In [21]:
y_pred = mod.predict(x_test) #predicted output

In [22]:
y_pred[:5] #prediction

4     19.497851
0     38.117397
11     9.473814
1     38.269171
18     9.887887
dtype: float64

In [23]:
y_test[:5] #actual output

4     18
0     42
11    13
1     37
18     9
Name: StackLoss, dtype: int64

### 3. Categorical Regression Model

In [106]:
df = pd.read_excel('CDAC_DataBook.xlsx',sheet_name = 'salaries')
df.head()

       rank discipline  yrs_phd  yrs_service gender  salary
0      Prof          B       19           18   Male  139750
1      Prof          B       20           16   Male  173200
2  AsstProf          B        4            3   Male   79750
3      Prof          B       45           39   Male  115000
4      Prof          B       40           41   Male  141500

In [107]:
df = df[['rank','yrs_service','salary']] #rank and yrs_service are predictor
df.head()

       rank  yrs_service  salary
0      Prof           18  139750
1      Prof           16  173200
2  AsstProf            3   79750
3      Prof           39  115000
4      Prof           41  141500

In [108]:
rank_dummy = pd.get_dummies(df['rank'],drop_first = True)
rank_dummy.head(10)

   AsstProf  Prof
0         0     1
1         0     1
2         1     0
3         0     1
4         0     1
5         0     0
6         0     1
7         0     1
8         0     1
9         0     1

In [109]:
df = df.drop('rank',axis = 1)

In [110]:
df = pd.concat([df,rank_dummy],axis = 1)
df.head()

   yrs_service  salary  AsstProf  Prof
0           18  139750         0     1
1           16  173200         0     1
2            3   79750         1     0
3           39  115000         0     1
4           41  141500         0     1

In [111]:
x_train = df.drop('salary',axis = 1)

In [112]:
y_train = df[['salary']]

In [113]:
x_train = df[['yrs_service','AsstProf','Prof']]

In [114]:
x_train = sm.add_constant(x_train,prepend = False)

In [115]:
mod = sm.OLS(y_train,x_train).fit()

In [116]:
print(mod.summary())

                            OLS Regression Results
==============================================================================
Dep. Variable:                 salary   R-squared:                       0.397
Model:                            OLS   Adj. R-squared:                  0.393
Method:                 Least Squares   F-statistic:                     86.30
Date:                Thu, 29 Jun 2023   Prob (F-statistic):           6.48e-43
Time:                        14:53:55   Log-Likelihood:                -4558.8
No. Observations:                 397   AIC:                             9126.
Df Residuals:                     393   BIC:                             9142.
Df Model:                           3
Covariance Type:            nonrobust
===============================================================================
                  coef    std err          t      P>|t|      [0.025      0.975]
-------------------------------------------------------------------------------
yrs_service  -158.1353    114.952     -1.376      0.170    -384.132      67.862
AsstProf    -1.462e+04   4270.606     -3.422      0.001    -2.3e+04   -6219.296
Prof         3.461e+04   3515.949      9.845      0.000    2.77e+04    4.15e+04
const        9.577e+04   3255.086     29.421      0.000    8.94e+04    1.02e+05
==============================================================================
Omnibus:                       43.077   Durbin-Watson:                   1.742
Prob(Omnibus):                  0.000   Jarque-Bera (JB):               66.186
Skew:                           0.711   Prob(JB):                     4.25e-15
Kurtosis:                       4.407   Cond. No.                         103.
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.